jlpoltrack/stm32ll-lib/src/stdstm32-uartb.h
typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTB_USE_TX_ISR) && (!defined UARTB_USE_TX)
  #error UARTB_USE_TX_ISR used without UARTB_USE_TX!
#endif
#if (defined UARTB_USE_RXERRORCOUNT) && (!defined UARTB_USE_RX)
  #error UARTB_USE_RXERRORCOUNT used without UARTB_USE_RX!
#endif

#ifdef UARTB_USE_TX_DMA
  #error UARTB_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTB_BAUD
  #define UARTB_BAUD             115200UL // 9600UL
#endif


#ifdef UARTB_USE_TX_ISR
  #ifndef UARTB_TXBUFSIZE
    #define UARTB_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTB_TXBUFSIZE < 2
    #error UARTB_TXBUFSIZE must be larger than 1 !
  #elif ((UARTB_TXBUFSIZE & (UARTB_TXBUFSIZE-1)) != 0)
    #error UARTB_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTB_TXBUFSIZEMASK  (UARTB_TXBUFSIZE-1)

  volatile char uartb_txbuf[UARTB_TXBUFSIZE];
  volatile uint16_t uartb_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartb_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTB_USE_RX
  #ifndef UARTB_RXBUFSIZE
    #define UARTB_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTB_RXBUFSIZE < 2
    #error UARTB_RXBUFSIZE must be larger than 1 !
  #elif ((UARTB_RXBUFSIZE & (UARTB_RXBUFSIZE-1)) != 0)
    #error UARTB_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTB_RXBUFSIZEMASK  (UARTB_RXBUFSIZE-1)

  volatile char uartb_rxbuf[UARTB_RXBUFSIZE];
  volatile uint16_t uartb_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartb_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTB_USE_RXERRORCOUNT
  volatile uint32_t uartb_errorcnt_rxnoise;
  volatile uint32_t uartb_errorcnt_rxframe;
  volatile uint32_t uartb_errorcnt_rxoverrun;
  #endif
#endif


// catch legacy defines
#if defined UARTB_USE_UART1_REMAPPED || defined UARTB_USE_UART1_REMAPPED2
  #error REMAPPED not supported anymore!
#endif
#if defined UARTB_USE_UART2_REMAPPED || defined UARTB_USE_UART2_REMAPPED2 || defined UARTB_USE_UART2_REMAPPED3
  #error REMAPPED not supported anymore!
#endif
#if defined UARTB_USE_UART3_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTB_USE_UART4_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTB_USE_UART6_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTB_USE_UART7_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTB_USE_LPUART1_REMAPPED
  #error REMAPPED not supported anymore!
#endif


#if defined UARTB_USE_UART1 || defined UARTB_USE_UART1_PA9PA10 || defined UARTB_USE_UART1_PB6PB7 || defined UARTB_USE_UART1_PC4PC5 || \
      defined UARTB_USE_UART1_PB14PB15
  #define UARTB_UARTx             USART1
  #ifdef UARTB_USE_UART1
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_UART1_PA9PA10
    #define UARTB_TX_IO           IO_PA9
    #define UARTB_RX_IO           IO_PA10
  #elif defined UARTB_USE_UART1_PB6PB7 // was UART1_REMAPPED
    #define UARTB_TX_IO           IO_PB6
    #define UARTB_RX_IO           IO_PB7
  #elif defined UARTB_USE_UART1_PC4PC5 // only G4 // was UART1_REMAPPED2
    #define UARTB_TX_IO           IO_PC4
    #define UARTB_RX_IO           IO_PC5
  #elif defined UARTB_USE_UART1_PB14PB15 // only C5
    #define UARTB_TX_IO           IO_PB14
    #define UARTB_RX_IO           IO_PB15
  #endif
  #ifndef STM32F0
    #define UARTB_IO_AF           IO_AF_7
  #else
    #ifdef UARTB_USE_UART1
      // user needs to specify UARTB_USE_IO_AF
    #elif defined UARTB_USE_UART1_PA9PA10
      #define UARTB_IO_AF         IO_AF_1
    #elif defined UARTB_USE_UART1_PB6PB7
      #define UARTB_IO_AF         IO_AF_0
    #else
      #error UARTB_USE_UART1 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTB_IRQn              USART1_IRQn
  #define UARTB_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32C5
    // C5: PA9/PA10 and PB6/PB7 are AF7 as set above, PB14/PB15 are AF4. the AF4 is
    // datasheet-verified on C551/C552/C562, and assumed to hold for the smaller parts.
    // PC4/PC5 is not a USART1 mapping on C5, it is USART3_RX.
    #if defined UARTB_USE_UART1_PC4PC5
      #error UARTB_USE_UART1_PC4PC5 not available on STM32C5 !
    #elif defined UARTB_USE_UART1_PB14PB15
      #undef UARTB_IO_AF
      #define UARTB_IO_AF         IO_AF_4
    #endif
  #endif

#elif defined UARTB_USE_UART2 || defined UARTB_USE_UART2_PA2PA3 || defined UARTB_USE_UART2_PD5PD6 || \
      defined UARTB_USE_UART2_PB3PB4 || defined UARTB_USE_UART2_PA14PA15 || defined UARTB_USE_UART2_PB3PA15 || \
      defined UARTB_USE_UART2_PA5PA15
  #define UARTB_UARTx             USART2
  #ifdef UARTB_USE_UART2
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_UART2_PA2PA3
    #define UARTB_TX_IO           IO_PA2
    #define UARTB_RX_IO           IO_PA3
  #elif defined UARTB_USE_UART2_PD5PD6 // was UART2_REMAPPED
    #define UARTB_TX_IO           IO_PD5
    #define UARTB_RX_IO           IO_PD6
  #elif defined UARTB_USE_UART2_PB3PB4 // only G4 // was UART2_REMAPPED2
    #define UARTB_TX_IO           IO_PB3
    #define UARTB_RX_IO           IO_PB4
  #elif defined UARTB_USE_UART2_PA14PA15 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK // was UART2_REMAPPED3
    #define UARTB_TX_IO           IO_PA14
    #define UARTB_RX_IO           IO_PA15
  #elif defined UARTB_USE_UART2_PB3PA15 // only G4
    #define UARTB_TX_IO           IO_PB3
    #define UARTB_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UARTB_IO_AF           IO_AF_7
  #else
    #if defined UARTB_USE_UART2
      // user needs to specify UARTB_USE_IO_AF
    #elif defined UARTB_USE_UART2_PA2PA3 || defined UARTB_USE_UART2_PA14PA15
      #define UARTB_IO_AF         IO_AF_1
    #else
      #error UARTB_USE_UART2 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTB_IRQn              USART2_IRQn
  #define UARTB_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32C5
    // C5 has USART2 only on PA2/PA3 (AF7, as set above) and PD5/PD6, and PD5/PD6 is not
    // bonded up to LQFP64. PB3/PB4 and PB3/PA15 are USART3 pins on C5, not USART2.
    #if defined UARTB_USE_UART2_PD5PD6
      #error UARTB_USE_UART2_PD5PD6 not bonded on STM32C5 packages up to LQFP64 ! use UARTB_USE_UART2_PA2PA3
    #elif defined UARTB_USE_UART2_PB3PB4 || defined UARTB_USE_UART2_PA14PA15 || \
          defined UARTB_USE_UART2_PB3PA15
      #error UARTB_USE_UART2 mapping not available on STM32C5 ! use UARTB_USE_UART2_PA2PA3
    #endif
  #endif

