jlpoltrack/stm32ll-lib/src/stdstm32-uartb.h
#elif defined UARTB_USE_UART3 || defined UARTB_USE_UART3_PB10PB11 || defined UARTB_USE_UART3_PC10PC11 || defined UARTB_USE_UART3_PB8PB9 || \
      defined UARTB_USE_UART3_PA4PA3 || defined UARTB_USE_UART3_PB3PB8
  #define UARTB_UARTx             USART3
  #if defined UARTB_USE_UART3
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_UART3_PB10PB11
    #define UARTB_TX_IO           IO_PB10
    #define UARTB_RX_IO           IO_PB11
  #elif defined UARTB_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UARTB_TX_IO           IO_PC10
    #define UARTB_RX_IO           IO_PC11
  #elif defined UARTB_USE_UART3_PB8PB9 // only F3
    #define UARTB_TX_IO           IO_PB8
    #define UARTB_RX_IO           IO_PB9
  #else
  #endif
  #ifndef STM32F0
    #define UARTB_IO_AF           IO_AF_7
  #else
    #if defined UARTB_USE_UART3
      // user needs to specify UARTB_USE_IO_AF
    #elif defined defined UARTB_USE_UART3_PB10PB11 || defined UARTB_USE_UART3_PB8PB9
      #define UARTB_IO_AF         IO_AF_4
    #elif defined UARTB_USE_UART3_PC10PC11
      #define UARTB_IO_AF         IO_AF_1
    #else
      #error UARTB_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTB_IRQn              USART3_IRQn
  #define UARTB_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTB_IRQn
    #undef UARTB_IRQHandler
    #define UARTB_IRQn            USART3_4_IRQn
    #define UARTB_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32C5
    // C5 USART3 is AF7 as set above, and only PC10/PC11 is bonded up to LQFP64.
    // PB3/PB4 is USART3 too, but on AF11, and is not offered as a mapping here.
    // the C5 parts without USART3 are caught by the CMSIS presence macro.
    #if !defined USART3
      #error UART3 NOT AVAILABLE !
    #elif defined UARTB_USE_UART3_PB10PB11
      #error UARTB_USE_UART3_PB10PB11 not available on STM32C5, PB11 is not a USART3 pin ! use UARTB_USE_UART3_PC10PC11
    #elif defined UARTB_USE_UART3_PB8PB9
      #error UARTB_USE_UART3_PB8PB9 not available on STM32C5 ! use UARTB_USE_UART3_PC10PC11
    #endif
  #endif

#elif defined UARTB_USE_UART4 || defined UARTB_USE_UART4_PC10PC11 || defined UARTB_USE_UART4_PA0PA1
  #define UARTB_UARTx             UART4
  #ifdef UARTB_USE_UART4
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_UART4_PC10PC11
    #define UARTB_TX_IO           IO_PC10
    #define UARTB_RX_IO           IO_PC11
  #elif defined UARTB_USE_UART4_PA0PA1 // only F7, C5 // was UART4_REMAPPED
    #define UARTB_TX_IO           IO_PA0
    #define UARTB_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTB_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTB_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTB_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UARTB_IO_AF           IO_AF_8
  #endif
  #define UARTB_IRQn              UART4_IRQn
  #define UARTB_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTB IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTB_IRQn
    #undef UARTB_IRQHandler
    #define UARTB_IRQn            USART3_4_IRQn
    #define UARTB_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32C5
  #endif

#elif defined UARTB_USE_UART5 || defined UARTB_USE_UART5_PC12PD2
  #define UARTB_UARTx             UART5
  #ifdef UARTB_USE_UART5
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_UART5_PC12PD2
    #define UARTB_TX_IO           IO_PC12
    #define UARTB_RX_IO           IO_PD2
  #endif
  #define UARTB_IRQn              UART5_IRQn
  #define UARTB_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTB_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTB IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTB_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTB_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UARTB_IO_AF           IO_AF_8
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

#elif defined UARTB_USE_UART6 || defined UARTB_USE_UART6_PC6PC7 || defined UARTB_USE_UART6_PG14PG9
  #define UARTB_UARTx             USART6
  #ifdef UARTB_USE_UART6
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_UART6_PC6PC7
    #define UARTB_TX_IO           IO_PC6
    #define UARTB_RX_IO           IO_PC7
  #elif defined UARTB_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UARTB_TX_IO           IO_PG14
    #define UARTB_RX_IO           IO_PG9
  #endif
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              USART6_IRQn
  #define UARTB_IRQHandler        USART6_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART6 NOT AVAILABLE !
  #endif

#elif defined UARTB_USE_UART7 || defined UARTB_USE_UART7_PE8PE7 || defined UARTB_USE_UART7_PF7PF6
  #define UARTB_UARTx             UART7
  #ifdef UARTB_USE_UART7
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_UART7_PE8PE7
    #define UARTB_TX_IO           IO_PE8
    #define UARTB_RX_IO           IO_PE7
  #elif defined UARTB_USE_UART7_PF7PF6 // was UART7_REMAPPED
    #define UARTB_TX_IO           IO_PF7
    #define UARTB_RX_IO           IO_PF6
  #endif
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              UART7_IRQn
  #define UARTB_IRQHandler        UART7_IRQHandler

