jlpoltrack/stm32ll-lib/src/stdstm32-uartb.h
  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART7 NOT AVAILABLE !
  #endif

#elif defined UARTB_USE_UART8 || defined UARTB_USE_UART8_PE1PE0
  #define UARTB_UARTx             UART8
  #ifdef UARTB_USE_UART8
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_UART8_PE1PE0
    #define UARTB_TX_IO           IO_PE1
    #define UARTB_RX_IO           IO_PE0
  #endif
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              UART8_IRQn
  #define UARTB_IRQHandler        UART8_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32C5
    #error UART8 NOT AVAILABLE !
  #endif

#elif defined UARTB_USE_LPUART1 || defined UARTB_USE_LPUART1_PA2PA3 || defined UARTB_USE_LPUART1_PC1PC0 || \
      defined UARTB_USE_LPUART1_PA9PA10 || defined UARTB_USE_LPUART1_PB6PB7
  #define UARTB_UARTx             LPUART1
  #ifdef UARTB_USE_LPUART1
    // user needs to specify UARTB_USE_TX_IO, UARTB_USE_RX_IO, and possibly UARTB_USE_IO_AF
  #elif defined UARTB_USE_LPUART1_PA2PA3
    #define UARTB_TX_IO           IO_PA2
    #define UARTB_RX_IO           IO_PA3
    #ifdef STM32G4
      #define UARTB_IO_AF         IO_AF_12 // G4
    #elif defined STM32C5
      // C5 silicon swap: AF table has PA2=LPUART1_RX, PA3=LPUART1_TX (opposite of G4/WL).
      // override the TX/RX IO assignments above for C5.
      #undef UARTB_TX_IO
      #undef UARTB_RX_IO
      #define UARTB_TX_IO         IO_PA3
      #define UARTB_RX_IO         IO_PA2
      #define UARTB_IO_AF         IO_AF_3
    #else
      #define UARTB_IO_AF         IO_AF_8 // WL
    #endif
  #elif defined UARTB_USE_LPUART1_PC1PC0 // was LPUART1_REMAPPED
    #define UARTB_TX_IO           IO_PC1
    #define UARTB_RX_IO           IO_PC0
    #define UARTB_IO_AF           IO_AF_8
  #elif defined UARTB_USE_LPUART1_PA9PA10 // only C5, not swapped
    #define UARTB_TX_IO           IO_PA9
    #define UARTB_RX_IO           IO_PA10
    #define UARTB_IO_AF           IO_AF_3
  #elif defined UARTB_USE_LPUART1_PB6PB7 // only C5, not swapped
    #define UARTB_TX_IO           IO_PB6
    #define UARTB_RX_IO           IO_PB7
    #define UARTB_IO_AF           IO_AF_8
  #endif
  #define UARTB_IRQn              LPUART1_IRQn
  #define UARTB_IRQHandler        LPUART1_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error LPUART1 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
  #elif defined STM32C5
    // C5 has LPUART1 on PA2/PA3 (AF3, RX/TX swapped, handled above), PA9/PA10 (AF3) and
    // PB6/PB7 (AF8). PC0/PC1 are bonded up to LQFP64, but carry SPI2, not LPUART1.
    #if defined UARTB_USE_LPUART1_PC1PC0
      #error UARTB_USE_LPUART1_PC1PC0 not available on STM32C5, PC0/PC1 are not LPUART1 pins ! use UARTB_USE_LPUART1_PA9PA10 or UARTB_USE_LPUART1_PB6PB7
    #endif
  #endif

#else
  #error No UARTB_USE_UARTx defined!
#endif


// LPUART1 uses the LL_LPUART_xxx API instead of LL_USART_xxx, so several blocks below
// have to know which one was selected. define it once here rather than repeating the
// list of LPUART1 mappings at every use.
#if defined UARTB_USE_LPUART1 || defined UARTB_USE_LPUART1_PA2PA3 || defined UARTB_USE_LPUART1_PC1PC0 || \
    defined UARTB_USE_LPUART1_PA9PA10 || defined UARTB_USE_LPUART1_PB6PB7
  #define UARTB_IS_LPUART
#endif


// allows us to overwrite the default pin assignment
#ifdef UARTB_USE_TX_IO
  #undef UARTB_TX_IO
  #define UARTB_TX_IO             UARTB_USE_TX_IO
#endif
#ifdef UARTB_USE_RX_IO
  #undef UARTB_RX_IO
  #define UARTB_RX_IO             UARTB_USE_RX_IO
#endif
#ifdef UARTB_USE_IO_AF
  #undef UARTB_IO_AF
  #define UARTB_IO_AF             UARTB_USE_IO_AF
#endif


// catch missing defines, compiler will throw error anyhow, but so it is nicer
#if defined UARTB_USE_TX && !defined UARTB_TX_IO
  #error No UARTB TX IO defined!
#endif
#if defined UARTB_USE_RX && !defined UARTB_RX_IO
  #error No UARTB RX IO defined!
#endif
#if !defined UARTB_IO_AF
  #error No UARTB IO AF defined!
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Note: LPUART does not appear to have STOPBITS_0_5 and STOPBITS_1_5!!
//
// The LL_USART_xx() and LL_LPUART_xx() functions which only relate to flags or
// registers can be used for both USART and LPUART.
// Below we simply use the LL_USART_xx() functions for both.
// Notably, this appears to be incorrect for the init struct functions, which hence
// need special treatment.

#if defined UARTB_IS_LPUART
#if !(LL_USART_PARITY_NONE == LL_LPUART_PARITY_NONE) || !(LL_USART_PARITY_EVEN == LL_LPUART_PARITY_EVEN) || \
    !(LL_USART_PARITY_ODD == LL_LPUART_PARITY_ODD) || \
    !(LL_USART_STOPBITS_1 == LL_LPUART_STOPBITS_1) || !(LL_USART_STOPBITS_2 == LL_LPUART_STOPBITS_2)
  //#error Missmatch of LL_USART and L_LPUART flags!
#endif
#endif


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  LL_USART_SR_RXNE
  #define FLAG_SR_ORE   LL_USART_SR_ORE
  #define FLAG_SR_NE    LL_USART_SR_NE
  #define FLAG_SR_FE    LL_USART_SR_FE
  #define FLAG_SR_TXE   LL_USART_SR_TXE
  #define FLAG_SR_TC    LL_USART_SR_TC
  #define FLAG_SR_IDLE  LL_USART_SR_IDLE
#elif defined STM32F3 || defined STM32F7 || defined STM32L4 || defined STM32F0
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#elif defined STM32G4 || defined STM32WL || defined STM32C5
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#endif

#if defined STM32F3 || defined STM32F7 || defined STM32F0
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NCF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#elif defined STM32G4 || defined STM32L4 || defined STM32WL || defined STM32C5
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UARTB_USE_RX || defined UARTB_USE_TX_ISR

void UARTB_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UARTB_UARTx, REG_SR); // read USART_SR register

