jlpoltrack/stm32ll-lib/src/stdstm32-uartb.h
#ifdef UARTB_USE_RX
  if ((usart_sr & FLAG_SR_RXNE) && LL_USART_IsEnabledIT_RXNE(UARTB_UARTx)) {
#ifdef UARTB_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uartb_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uartb_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uartb_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UARTB_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UARTB_RX_CALLBACK_FULL
    UARTB_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uartb_rxwritepos + 1) & UARTB_RXBUFSIZEMASK;
    if (uartb_rxreadpos != next) { // fifo not full
      uartb_rxbuf[next] = usart_dr;
      uartb_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UARTB_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#else
  // F3: ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  // F7: these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UARTB_UARTx, ICR, FLAGS_ICR);
#endif
#endif

#ifdef UARTB_USE_TX_ISR
  if ((usart_sr & FLAG_SR_TXE) && LL_USART_IsEnabledIT_TXE(UARTB_UARTx)) {
    if (uartb_txwritepos != uartb_txreadpos) { // fifo not empty
      uartb_txreadpos = (uartb_txreadpos + 1) & UARTB_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UARTB_UARTx, uartb_txbuf[uartb_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UARTB_UARTx); // disable interrupt when empty
#ifdef UARTB_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UARTB_UARTx); // enable TC interrupt
      LL_USART_EnableIT_TC(UARTB_UARTx);
#endif
#ifdef UARTB_IDLE_CALLBACK
      LL_USART_ClearFlag_IDLE(UARTB_UARTx); // enable IDLE interrupt
      LL_USART_EnableIT_IDLE(UARTB_UARTx);
#endif
    }
  }

#ifdef UARTB_TC_CALLBACK
  if ((usart_sr & FLAG_SR_TC) && LL_USART_IsEnabledIT_TC(UARTB_UARTx)) {
    LL_USART_DisableIT_TC(UARTB_UARTx);
    LL_USART_ClearFlag_TC(UARTB_UARTx);
    UARTB_TC_CALLBACK();
  }
#endif
#ifdef UARTB_IDLE_CALLBACK
  if ((usart_sr & FLAG_SR_IDLE) && LL_USART_IsEnabledIT_IDLE(UARTB_UARTx)) {
    LL_USART_DisableIT_IDLE(UARTB_UARTx);
    LL_USART_ClearFlag_IDLE(UARTB_UARTx);
    UARTB_IDLE_CALLBACK();
  }
#endif
#endif
}

#endif // defined UARTB_USE_RX || defined UARTB_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UARTB_USE_TX

uint16_t uartb_putc(char c)
{
#ifndef UARTB_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UARTB_UARTx)) {}
  LL_USART_TransmitData8(UARTB_UARTx, c);
  return 1;
#else
  uint16_t next = (uartb_txwritepos + 1) & UARTB_TXBUFSIZEMASK;
  if (uartb_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uartb_txbuf[next] = c;
    uartb_txwritepos = next;
    LL_USART_EnableIT_TXE(UARTB_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


void uartb_puts(const char *s)
{
  while (*s) {
    uartb_putc(*s);
    s++;
  }
}


void uartb_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uartb_putc(buf[i]);
}


#ifdef UARTB_USE_TX_ISR
uint16_t uartb_tx_notfull(void)
{
  uint16_t next = (uartb_txwritepos + 1) & UARTB_TXBUFSIZEMASK;
  return (uartb_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uartb_tx_isempty(void)
{
  if (uartb_txwritepos == uartb_txreadpos) return 1;
  return 0;
}


static inline void uartb_tx_flush(void)
{
  uartb_txwritepos = uartb_txreadpos = 0;
}
#else
static inline void uartb_tx_flush(void) {}
#endif

#endif // defined UARTB_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTB_USE_RX

static inline uint16_t uartb_rx_available(void)
{
  if (uartb_rxwritepos == uartb_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uartb_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uartb_rxwritepos - (int16_t)uartb_rxreadpos;
  return (d < 0) ? d + (UARTB_RXBUFSIZEMASK + 1) : d;
}


char uartb_getc(void)
{
  while (uartb_rxwritepos == uartb_rxreadpos) {};
  uartb_rxreadpos = (uartb_rxreadpos + 1) & UARTB_RXBUFSIZEMASK;
  return uartb_rxbuf[uartb_rxreadpos];
}


void uartb_getbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) buf[i] = uartb_getc();
}


static inline char uartb_lookatnextc(void)
{
  return uartb_rxbuf[(uartb_rxreadpos + 1) & UARTB_RXBUFSIZEMASK];
}


static inline void uartb_rx_flush(void)
{
  uartb_rxwritepos = uartb_rxreadpos = 0;
}

#endif // defined UARTB_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------
// ATTENTION:
// LPUART does not support 0.5 or 1.5 stop bits !!

// helper, usually should not be called itself
void _uartb_initprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTB_IS_LPUART)
LL_USART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != XUART_PARITY_NO) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  UART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4 || defined STM32C5
  UART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif

